# Books DB

## ERD

![png](./images/ERD.png)

## Imports

In [4]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

## Load Data

In [5]:
users = pd.read_csv('data/users.csv', index_col = 'id')
books = pd.read_csv('data/books.csv', index_col = 'id')
authors = pd.read_csv('data/authors.csv', index_col = 'id')
favorites = pd.read_csv('data/favorites.csv', index_col = 'user_id')

print('User DF')
display(users.head(2))
print('books DF')
display(books.head(2))
print('authors DF')
display(authors.head(2))
print('favoritss DF')
display(favorites.head(2))

User DF

   first_name last_name            email
id
1        John       Doe     JD@books.com
2       Robin     Smith  Robin@books.com

books DF

          title  author_id
id
1   The Shining          1
2            It          1

authors DF

          author_name
id
1        Stephen King
2   F.Scott Fitgerald

favoritss DF

         book_id
user_id
1              1
1              2

## Engine and Connection

In [6]:
# Update to include name and pass
conn = "mysql+pymysql://NAME:PASS@localhost/books"

In [7]:
engine = create_engine(conn)

## Create DB

In [8]:
if database_exists(conn) == False: create_database(conn)
else: print('The database already exists')

The database already exists

In [13]:
users.to_sql('users', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favorites.to_sql('favorites', engine, if_exists = 'replace')

## Test the DB

In [14]:
q = '''SHOW TABLES'''

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [15]:
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
    '''

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1